Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: སྲས་ནི་སྣ་ཚོགས་ཅན་ཞེས་བྱའོ། །
en: Diverse will be his son.

source: རིམ་གྲོ་པ་ནི་མཆོད་འོས་ཞེས་བྱའོ། །
en: Worthy of Worship will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་ལག་ཅེས་བྱའོ། །
en: Precious Hand will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མུན་པ་བྲལ་ཞེས་བྱའོ། །
en: Free from Darkness will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ་ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be sixteen successive congregations, each of them gathering one billion.

source: དེ་བཞིན་གཤེགས་པ་སྤོས་ཀྱི་གླང་པོ་སྐྱེ་བའི་ཡུལ་ནི་སྤོས་ལྡན་ཞེས་བྱའོ། །
en: “The thus-gone Gandhahastin will be born in a place called Fragrant.

source: ཡབ་ནི་སྤོས་ཀྱི་དབང་ཕྱུག་ཅེས་བྱའོ། །
en: Fragrance Master will be his father.

source: ཡུམ་ནི་ཡིད་འོང་སྤོས་ཞེས་བྱའོ། །
en: Delightful Fragrance will be his mother.

source: སྲས་ནི་ཡོན་ཏན་སྤོས་ཞེས་བྱའོ། །
en: Fragrance Qualities will be his son.

source: རིམ་གྲོ་པ་ནི་འོད་འཕྲོ་ཅན་ཞེས་བྱའོ། །
en: Radiant will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འདམ་ལས་བརྒལ་ཞེས་བྱའོ། །
en: Crossing the Swamp will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསམ་པ་བྱིན་ཞེས་བྱའོ། །
en: Gift of Reflection will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་དྲུག་སྟེ་ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་དྲུག་དྲུག་གོ། །
en: There will be six successive congregations of hearers, each of them gathering six hundred million.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་ཉི་ཁྲི་ལྔ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for twenty-five thousand years.

source: དེ་བཞིན་གཤེགས་པ་སྲེད་མེད་ཀྱི་བུ་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་བརྟན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Nārāyaṇa will be born in a place called Stable Splendor.

source: ཡབ་ནི་དཔའ་བོ་ཞེས་བྱའོ། །
en: Hero will be his father.

source: ཡུམ་ནི་མཚོན་ཆ་བཟང་ཞེས་བྱའོ། །
en: Excellent Weapon will be his mother.

source: སྲས་ནི་མཐུ་རྩལ་སྟོབས་ཞེས་བྱའོ། །
en: Powerful Strength will be his son.

source: རིམ་གྲོ་པ་ནི་སྒྱིད་མི་ལུག་པ་ཞེས་བྱའོ། །
en: Untiring will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་སྟོབས་བསྐྱེད་ཅེས་བྱའོ། །
en: Engendering the Strength of Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཕས་ཀྱི་རྒོལ་བ་ཚར་གཅོད་ཅེས་བྱའོ། །
en: Defeater of Attacks will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་རྩ་བཞི་སྟེ་ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སྟོང་སྟོང་ངོ་། །
en: There will be eighty-four congregations of hearers, each of them gathering ten billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དགུ་ཁྲི་ཉིས་སྟོང་ངོ་། །
en: The extent of his lifespan will be ninety-two thousand years.

source: དེ་བཞིན་གཤེགས་པ་དེས་པ་སྐྱེ་བའི་ཡུལ་ནི་དགའ་བའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: “The thus-gone Sūrata will be born in a place called Splendor of Joy.

source: འོད་ནི་དཔག་ཚད་བཅུ་དགུའོ། །
en: His light will extend nineteen leagues.

source: ཡབ་ནི་ཁུང་མེད་ཅེས་བྱའོ། །
en: Sourceless will be his father.

source: ཡུམ་ནི་དགའ་བའི་དབང་ཕྱུག་ཅེས་བྱའོ། །
en: Lady of Joy will be his mother.

source: སྲས་ནི་ཡིད་འོང་བྱིན་ཞེས་བྱའོ། །
en: Delightful Gift will be his son.

source: རིམ་གྲོ་པ་ནི་ཕན་པའི་བློ་ཞེས་བྱའོ། །
en: Beneficial Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་བའི་ཏོག་གི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Moon Crest Banner will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བརྩོན་འགྲུས་བརྟན་པ་ཞེས་བྱའོ། །
en: Stable Diligence will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་གསུམ་སྟེ་ཐམས་ཅད་ལ་ཡང་སུམ་འབུམ་སུམ་འབུམ་མོ། །
en: There will be three congregations of hearers, each of them gathering three hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་མི་ཚུགས་པ་སྐྱེ་བའི་ཡུལ་ནི་ཚུགས་པ་མེད་པའི་འཁོར་ལོ་ཞེས་བྱའོ། །
en: “The thus-gone Anihata will be born in a place called Indestructible Wheel.

source: ཡབ་ནི་ཉི་མའི་གདུགས་ཞེས་བྱའོ། །
en: Sun Parasol will be his father.

source: ཡུམ་ནི་ཆོས་ཀྱི་བླ་མ་ཞེས་བྱའོ། །
en: Highest Dharma will be his mother.

source: སྲས་ནི་མདངས་སྡུག་ཅེས་བྱའོ། །
en: Beautiful Brightness will be his son.

source: རིམ་གྲོ་པ་ནི་ཆོས་ཀྱི་མཛོད་ཅེས་བྱའོ། །
en: Dharma Treasury will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དྲན་གྲོགས་ཞེས་བྱའོ། །
en: Mindfulness Companion will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷ་གསལ་ཞེས་བྱའོ། །
en: Divine Clarity will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དྲུག་སྟེ་ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be six consecutive congregations, each of them gathering one hundred eighty million.

source: དེ་བཞིན་གཤེགས་པ་ཉི་ཟླ་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེའི་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Candrārka will be born in a place called Jewel Light.

source: ཡབ་ནི་ཟླ་བ་ཞེས་བྱའོ། །
en: Moon will be his father.

source: ཡུམ་ནི་རིན་ཆེན་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Jewel Splendor will be his mother.

source: སྲས་ནི་ཟླས་བྱིན་ཞེས་བྱའོ། །
en: Moon Gift will be his son.

source: རིམ་གྲོ་པ་ནི་འཇམ་པའི་དབྱངས་ཞེས་བྱའོ། །
en: Gentle Melody will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་གནས་ཞེས་བྱའོ། །
en: Abiding Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཚུལ་ཁྲིམས་རྣམ་དག་འོད་ཅེས་བྱའོ། །
en: Light of Pure Discipline will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་རྩ་བཞི་སྟེ་ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be eighty-four consecutive congregations, each of them gathering one trillion.

source: དེ་བཞིན་གཤེགས་པ་གློག་གི་ཏོག་སྐྱེ་བའི་ཡུལ་ནི་འོད་རྟག་ཅེས་བྱའོ། །
en: “The thus-gone Vidyutketu will be born in a place called Constant Light.

source: ཡབ་ནི་དབང་པོའི་ཏོག་ཅེས་བྱའོ། །
en: Crest of Masters will be his father.

source: ཡུམ་ནི་ནོར་ལྷའི་བུའི་འོད་ཅེས་བྱའོ། །
en: Light of the Child of the Wealth God will be his mother.

source: སྲས་ནི་ཉི་མའི་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Sun Lamp will be his son.

source: རིམ་གྲོ་པ་ནི་བློ་གྲོས་ལེགས་སེམས་ཞེས་བྱའོ། །
en: Intelligence and Proper Attention will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡིད་འོང་སེམས་ཞེས་བྱའོ། །
en: Delightful Mind will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་དྲུག་ཅུ་སྟེ་ཐམས་ཅད་ལ་ཡང་འབུམ་འབུམ་མོ། །
en: There will be sixty consecutive congregations of worthy ones, each of them gathering one hundred thousand.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དྲུག་ཁྲི་ཆིག་སྟོང་ངོ་། །
en: The extent of his lifespan will be sixty-one thousand years.

source: དེ་བཞིན་གཤེགས་པ་མཆོད་པ་སྐྱེ་བའི་ཡུལ་ནི་བལྟ་ན་ཡིད་དུ་འོང་བ་ཞེས་བྱའོ། །
en: “The thus-gone Mahita will be born in a place called Delightful to Behold.

source: འོད་ནི་དཔག་ཚད་ཕྱེད་དང་གསུམ་མོ། །
en: His light will extend three and half leagues.

source: ཡུམ་ནི་ཡེ་ཤེས་འོད་ཟེར་ཞེས་བྱའོ། །
en: Radiance of Wisdom will be his mother.

source: སྲས་ནི་བསོད་ནམས་འདོད་ཅེས་བྱའོ། །
en: Merit Wish will be his son.

source: རིམ་གྲོ་པ་ནི་ཐར་པའི་སེམས་ཞེས་བྱའོ། །
en: Mind of Liberation will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟིལ་གྱིས་མི་ནོན་ཅེས་བྱའོ། །
en: Indomitable will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་མངོན་དགའ་ཞེས་བྱའོ། །
en: Joyous World will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བཅུ་སྟེ་ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་དྲུག་དྲུག་གོ། །
en: There will be ten consecutive congregations of worthy ones, each of them gathering six hundred million.

source: དེ་བཞིན་གཤེགས་པ་དཔལ་སྦས་སྐྱེ་བའི་ཡུལ་ནི་ཟླ་བའི་ཏོག་ཅེས་བྱའོ། །
en: “The thus-gone Śrīgupta will be born in a place called Moon Crest.

source: འོད་ནི་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་བཅུ་ཙམ་མོ། །
en: His light will cover ten worlds of four continents.

source: ཡབ་ནི་བློ་བཟངས་ཞེས་བྱའོ། །
en: Excellent Mind will be his father.

source: ཡུམ་ནི་རིན་ཆེན་བློ་ཞེས་བྱའོ། །
en: Jewel Mind will be his mother.

source: སྲས་ནི་ཆོས་ཀྱི་མཐུ་རྩལ་ཞེས་བྱའོ། །
en: Power of the Dharma will be his son.

source: རིམ་གྲོ་པ་ནི་བློ་དབྱངས་ཞེས་བྱའོ། །
en: Wisdom Melody will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གནས་པ་མེད་པའི་བློ་ཞེས་བྱའོ། །
en: Nonabiding Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བརྟུལ་ཞུགས་ཡང་དག་པར་འཕགས་ཞེས་བྱའོ། །
en: Truly Superior Yogic Discipline will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ་ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་སུམ་ཅུ་སུམ་ཅུའོ། །
en: There will be sixteen consecutive congregations, each of them gathering thirty billion.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཉི་མ་སྐྱེ་བའི་ཡུལ་ནི་འོད་མཐའ་ཡས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Jñānasūrya will be born in a place called Infinite Light.

source: འོད་ནི་འཇིག་རྟེན་གྱི་ཁམས་སུམ་ཅུ་རྩ་གཉིས་ཙམ་མོ། །
en: His light will cover thirty-two world systems.

source: ཡུམ་ནི་བཟང་མཆོག་མ་ཞེས་བྱའོ། །
en: Supreme Excellence will be his mother.

source: སྲས་ནི་ཉི་མའི་གདོང་ཞེས་བྱའོ། །
en: Sun Face will be his son.

source: རིམ་གྲོ་པ་ནི་བརྟུལ་ཞུགས་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellent Yogic Discipline will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྟོན་པ་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite Teacher will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་ཅན་ཞེས་བྱའོ། །
en: Endowed with Wisdom will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ་ཐམས་ཅད་ལ་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་དུང་ཕྱུར་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be sixteen consecutive congregations, each of them gathering eight hundred million irreversible bodhisattvas.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བརྒྱད་བརྒྱའོ། །
en: The extent of his lifespan will be eight hundred years.

source: དམ་པའི་ཆོས་ནི་ལོ་ཁྲིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for ten thousand years.

source: དེ་བཞིན་གཤེགས་པ་དོན་གྲུབ་སྐྱེ་བའི་ཡུལ་ནི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་འབྱུང་བ་ཞེས་བྱའོ། །
en: “The thus-gone Siddhārtha will be born in a place called Fulfilment of Wishes.

source: འོད་ནི་དཔག་ཚད་ཁྲི་ཉིས་སྟོང་ངོ་། །
en: His light will extend twelve thousand leagues.

source: ཡབ་ནི་གཽ་ཏ་མ་ཞེས་བྱའོ། །
en: Gautama will be his father.

source: ཡུམ་ནི་ཡིད་དུ་འོང་བའི་ང་རོ་ཞེས་བྱའོ། །
en: Delightful Roar will be his mother.

source: རིམ་གྲོ་པ་ནི་བརྟན་པས་བྱིན་ཞེས་བྱའོ། །
en: Gift of the Firm will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྙིང་པོ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Essence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་དགའ་ཞེས་བྱའོ། །
en: Joyous Mind will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་བདུན་ཏེ་ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be seventeen consecutive congregations, each of them gathering one hundred eighty million.

source: དེ་བཞིན་གཤེགས་པ་ལྷུན་པོ་བརྩེགས་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེ་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Merukūṭa will be born in a place called Jewel Array.

source: ཡབ་ནི་བློ་གྲོས་གནས་ཞེས་བྱའོ། །
en: Abiding Intelligence will be his father.

source: ཡུམ་ནི་མཉམ་སེམས་ཞེས་བྱའོ། །
en: Equanimous Mind will be his mother.

source: སྲས་ནི་བློ་འོད་ཅེས་བྱའོ། །
en: Luminous Mind will be his son.

source: རིམ་གྲོ་པ་ནི་ཆོས་ཀྱི་དབང་ཕྱུག་ཅེས་བྱའོ། །
en: Dharma Master will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཚོགས་ཅན་འོད་ཅེས་བྱའོ། །
en: Light of the Gathering will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཆོས་ཀྱི་ཆོ་འཕྲུལ་ཞེས་བྱའོ། །
en: Dharma Miracle will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ་ཐམས་ཅད་ལ་ཡང་ཁྲི་ཕྲག་རེ་རེའོ། །
en: There will be sixteen consecutive congregations of worthy ones, each of them gathering ten thousand.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་འདུལ་སྐྱེ་བའི་ཡུལ་ནི་འཇིགས་པ་དང་བྲལ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Aridama will be born in a place called Freedom from Fear.

source: འོད་ནི་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་དྲུག་ཅུ་ཙམ་མོ། །
en: His light will extend as far as sixty worlds of four continents.

source: ཡབ་ནི་ཐུབ་མེད་གྲགས་ཞེས་བྱའོ། །
en: Indomitable Fame will be his father.

source: ཡུམ་ནི་བློ་གྲོས་གྲགས་ཞེས་བྱའོ། །
en: Famed Intelligence will be his mother.

source: སྲས་ནི་བློ་གྲོས་མཛེས་ཞེས་བྱའོ། །
en: Beautiful Intelligence will be his son.

source: རིམ་གྲོ་པ་ནི་གདངས་སྙན་ཅེས་བྱའོ། །
en: Delightful Melody will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཙམ་པའི་དཔལ་ཞེས་བྱའོ། །
en: Campaka Glory will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྟོབས་ཆེན་ཞེས་བྱའོ། །
en: Great Strength will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་དྲུག་སྟེ་ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སྟོང་སྟོང་ངོ་། །
en: There will be thirty-six consecutive congregations of worthy ones, each of them gathering ten billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ཁྲིའོ། །
en: The extent of his lifespan will be ten thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་བཞིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for one hundred forty million years.

source: སྐུ་གདུང་ནི་རྒྱས་པར་འགྱུར་རོ།། །།
en: His relics will be abundant.

source: དེ་བཞིན་གཤེགས་པ་པད་མ་སྐྱེ་བའི་ཡུལ་ནི་པད་མ་དཀར་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Padma will be born in a place called White Lotus.

source: འོད་ནི་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་བཅྭ་བརྒྱད་ཙམ་མོ། །
en: His light will extend as far as eighteen worlds of four continents.

source: ཡུམ་ནི་ཨུད་པ་ལ་ཕྲེང་ཞེས་བྱའོ། །
en: Utpala Garland will be his mother.

source: སྲས་ནི་མེ་ཏོག་ཕུང་པོ་ཞེས་བྱའོ། །
en: Flower Mountain will be his son.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་རྒྱ་མཚོ་ཞེས་བྱའོ། །
en: Ocean of Qualities will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཀུན་ཏུ་མཛེས་པ་ཞེས་བྱའོ། །
en: Beautiful in All Regards will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྐྱེ་བོའི་མཆོད་རྟེན་ཞེས་བྱའོ། །
en: Stūpa for Humanity will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བདུན་ཅུ་རྩ་དྲུག་སྟེ། །ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་བཞི་བཞིའོ། །
en: There will be seventy-six consecutive congregations of worthy ones, each of them gathering nine hundred forty million.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་གྲགས་པ་སྐྱེ་བའི་ཡུལ་ནི་དྲང་སྲོང་དད་པ་ཞེས་བྱའོ། །
en: “The thus-gone, the worthy one, Arthakīrti will be born in a place called Sage Faith.

source: ཡབ་ནི་ཚངས་འདོད་ཅེས་བྱའོ། །
en: Brahmā Wish will be his father.

source: ཡུམ་ནི་བདེན་བྱིན་ཞེས་བྱའོ། །
en: Truth Gift will be his mother.

source: སྲས་ནི་དགའ་འཛིན་ཅེས་བྱའོ། །
en: Joy Holder will be his son.

source: རིམ་གྲོ་པ་ནི་སྡུག་དགའ་ཞེས་བྱའོ། །
en: Joyous Beauty will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མི་གཡོ་བློ་ཞེས་བྱའོ། །
en: Unwavering Mind will be foremost in terms of insight.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བཅྭ་བརྒྱད་དེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་བཅུ་བཞི་བཅུ་བཞིའོ། །
en: There will be eighteen consecutive congregations of worthy ones, each of them gathering fourteen billion.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་འབུམ་གྱི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for one hundred thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་འགྲོས་སྐྱེ་བའི་ཡུལ་ནི་སྤོབས་པའི་དཔལ་ཞེས་བྱའོ། །
en: “The thus-gone Jñānakrama will be born in a place called Glorious Acumen.

source: ཡབ་ནི་བརྟུལ་ཞུགས་འབྱོར་ཅེས་བྱའོ། །
en: Wealth of Yogic Discipline will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་བསམ་པ་ཅན་ཞེས་བྱའོ། །
en: Endowed with the Qualities of Reflection will be his mother.

source: སྲས་ནི་ཐར་པའི་སེམས་ཞེས་བྱའོ། །
en: Mind of Liberation will be his son.

source: རིམ་གྲོ་པ་ནི་དོན་ཡོད་སེམས་ཞེས་བྱའོ། །
en: Meaningful Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཁ་ལོ་སྒྱུར་བའི་འོད་ཅེས་བྱའོ། །
en: Light of Leadership will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྒོལ་བ་བསལ་ཞེས་བྱའོ། །
en: Dispeller of Attacks will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be ten consecutive congregations of worthy ones, each of them gathering one billion.

source: དེ་བཞིན་གཤེགས་པ་ཉོན་མོངས་བྲལ་སྐྱེ་བའི་ཡུལ་ནི་འཇམ་པ་ཞེས་བྱའོ། །
en: “The thus-gone Apagatakleśa will be born in a place called Smooth.

source: ཡབ་ནི་གཉེན་བཟངས་ཞེས་བྱའོ། །
en: Excellent Friend will be his father.

source: ཡུམ་ནི་རྒུན་ཆང་མྱོས་ཞེས་བྱའོ། །
en: Drunk on Wine will be his mother.

source: སྲས་ནི་པད་མའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Lotus Essence will be his son.

source: རིམ་གྲོ་པ་ནི་དྲན་པ་གསལ་ཞེས་བྱའོ། །
en: Clear Mindfulness will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐོགས་པ་མེད་པའི་སེམས་ཞེས་བྱའོ། །
en: Unimpeded Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དུལ་བའི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Banner of Training will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགྲ་བཅོམ་པ་བྱེ་བ་ཕྲག་འབུམ་མོ། །
en: In the first congregation will gather one trillion worthy ones;

source: གཉིས་པ་ལ་ནི་བྱེ་བ་ཕྲག་བཅུའོ། །
en: in the second there will be one hundred million,

source: གསུམ་པ་ལ་ནི་ཕྲག་སུམ་ཅུའོ། །
en: and in the third there will be three hundred million.

source: དམ་པའི་ཆོས་ནི་ལོ་དྲུག་ཁྲི་དྲུག་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for sixty-six thousand years.

source: དེ་བཞིན་གཤེགས་པ་འདམ་བུ་སྐྱེ་བའི་ཡུལ་ནི་རྩེ་དགའ་ཞེས་བྱའོ། །
en: “The thus-gone Nala will be born in a place called Playful.

source: འོད་ནི་དཔག་ཚད་དྲུག་ཅུ་རྩ་བརྒྱད་དོ། །
en: His light will extend sixty-eight leagues.

source: ཡབ་ནི་རིན་པོ་ཆེའི་འབྱུང་གནས་ཞེས་བྱའོ། །
en: Source of Jewels will be his father.

source: སྲས་ནི་བཤེས་གཉེན་བདེན་ཞེས་བྱའོ། །
en: True Friend will be his son.

source: རིམ་གྲོ་པ་ནི་བཟང་པོའི་ཏོག་ཅེས་བྱའོ། །
en: Excellent Crest will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསོད་ནམས་ཕུང་པོ་ཞེས་བྱའོ། །
en: Heap of Merit will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འབྱོར་པའི་མཛོད་ཅེས་བྱའོ། །
en: Rich Treasury will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་གསུམ་སྟེ། །ཐམས་ཅད་ལ་ཡང་བརྒྱད་ཁྲི་བརྒྱད་ཁྲིའོ། །
en: There will be three consecutive congregations of worthy ones, each of them gathering eighty thousand.

source: དེ་བཞིན་གཤེགས་པ་སྤོས་བཟངས་སྐྱེ་བའི་ཡུལ་ནི་འོད་མཐའ་ཡས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Sugandha will be born in a place called Limitless Light.

source: ཡབ་ནི་ཡེ་ཤེས་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Wisdom Banner will be his father.

source: ཡུམ་ནི་དྲང་སྲོང་དགའ་ཞེས་བྱའོ། །
en: Sage Joy will be his mother.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་གྲགས་པ་ཞེས་བྱའོ། །
en: Famed Qualities will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྤྱོད་པའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Active Intelligence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ས་འཛིན་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Earth Holding King will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བཅུ་བཞི་སྟེ་ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སྟོང་སྟོང་ངོ་། །
en: There will be fourteen consecutive congregations of worthy ones, each of them gathering ten billion.

source: དམ་པའི་ཆོས་ནི་ལོ་དུང་ཕྱུར་ཕྲག་བདུན་གྱི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for seven hundred million years.

source: དེ་བཞིན་གཤེགས་པ་ཡུལ་འཁོར་རངས་སྐྱེ་བའི་ཡུལ་ནི་ལེགས་པར་བསྲུངས་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: “The thus-gone Anupamarāṣṭra will be born in a place called Well-Protected Splendor.

source: འོད་ནི་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཙམ་མོ། །
en: His light will extend as far as this world of four continents.

source: ཡུམ་ནི་རིན་ཆེན་ལྡན་ཞེས་བྱའོ། །
en: Possessor of Jewels will be his mother.

source: སྲས་ནི་བཻ་དཱུརྱའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Beryl Essence will be his son.

source: རིམ་གྲོ་པ་ནི་གྲགས་པའི་རྒྱ་མཚོ་ཞེས་བྱའོ། །
en: Ocean of Fame will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐའ་ཡས་ལག་ཅེས་བྱའོ། །
en: Infinite Hand will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་ཚང་བ་ཞེས་བྱའོ། །
en: Complete Power will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་བརྒྱད་དེ། །ཐམས་ཅད་ལ་ཡང་ཁྲི་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be thirty-eight consecutive congregations of hearers, each of them gathering one billion.

source: དེ་བཞིན་གཤེགས་པ་ལྷ་གྲགས་སྐྱེ་བའི་ཡུལ་ནི་ལྷ་དགའ་ཞེས་བྱའོ། །
en: “The thus-gone Marudyaśas will be born in a place called Divine Joy.

source: འོད་ནི་གླིང་ཆེན་པོ་བཞི་པའི་བྱེ་མ་སྙེད་ཙམ་མོ། །
en: His light will be as profuse as the sands contained in this world of four continents.

source: ཡུམ་ནི་ནོར་ལྷའི་བུ་ཞེས་བྱའོ། །
en: Child of the Wealth God will be his mother.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཆོས་བརྩེགས་ཞེས་བྱའོ། །
en: Dharma Mountain will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྗོན་པའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flowering Tree will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅྭ་བརྒྱད་དེ་ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་བཞི་བཞིའོ། །
en: There will be eighteen consecutive congregations, each of them gathering one hundred forty million.

source: དེ་བཞིན་གཤེགས་པ་སྲིད་མཐའ་གཟིགས་སྐྱེ་བའི་ཡུལ་ནི་དགའ་བས་བལྟས་ཞེས་བྱའོ། །
en: “The thus-gone Bhavāntadarśin will be born in a place called Seen with Joy.

source: ཡབ་ནི་མྱ་ངན་མེད་ཅེས་བྱའོ། །
en: Free from Suffering will be his father.

source: ཡུམ་ནི་དགའ་བས་བྱིན་ཞེས་བྱའོ། །
en: Gift of Joy will be his mother.

source: སྲས་ནི་རི་བརྩེགས་ཞེས་བྱའོ། །
en: Lofty Mountain will be his son.

source: རིམ་གྲོ་པ་ནི་མཚན་བྱིན་ཞེས་བྱའོ། །
en: Gift of Marks will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཟི་བརྗིད་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Splendor will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡིད་དུ་འོང་བའི་འོད་ཅེས་བྱའོ། །
en: Delightful Light will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཞི་བཅུ་སྟེ་ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་བཅྭ་ལྔ་བཅྭ་ལྔའོ། །
en: There will be forty consecutive congregations, each of them gathering one hundred fifty million.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བ་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Candra will be born in a place called Studded.

source: ཡབ་ནི་ཟླ་བའི་ཏོག་ཅེས་བྱའོ། །
en: Moon Crest will be his father.

source: ཡུམ་ནི་ཉི་མའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Sun Essence will be his mother.

source: སྲས་ནི་གཟི་བརྗིད་འོད་ཅེས་བྱའོ། །
en: Splendid Light will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྒྲིབ་མེད་མཐོང་ཞེས་བྱའོ། །
en: Unobscured Perception will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བརྩོན་པ་མི་གཏོང་བ་ཞེས་བྱའོ། །
en: Unrelenting Diligence will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཞི་བཅུ་སྟེ་ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be forty consecutive congregations, each of them gathering one hundred eighty million.

source: དེ་བཞིན་གཤེགས་པ་སྒྲ་གཅན་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེ་འབར་བ་ཞེས་བྱའོ། །
en: “The thus-gone Rāhu will be born in a place called Blazing Jewels.

source: ཡབ་ནི་གློག་འོད་ཅེས་བྱའོ། །
en: Flashing Light will be his father.

source: ཡུམ་ནི་ཡིད་དུ་འོང་བའི་འོད་ཅེས་བྱའོ། །
en: Delightful Light will be his mother.

source: སྲས་ནི་མཐུ་རྩལ་བརྟན་ཞེས་བྱའོ། །
en: Stable Power will be his son.

source: རིམ་གྲོ་པ་ནི་མཐུ་རྩལ་སེམས་ཞེས་བྱའོ། །
en: Mind of Power will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐོགས་པ་མེད་པ་ཞེས་བྱའོ། །
en: Unimpeded will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དྲག་ཤུལ་འབར་ཞེས་བྱའོ། །
en: Fierce Blazing will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགྲ་བཅོམ་པ་འབུམ་ཕྲག་བརྒྱད་ཁྲིའོ། །གཉིས་པ་ལ་ནི་འབུམ་ཕྲག་དྲུག་ཁྲིའོ། །གསུམ་པ་ལ་ནི་འབུམ་ཕྲག་བཞི་ཁྲིའོ། །
en: In the first congregation there will be eight billion worthy ones, in the second there will be six billion, and in the third there will be four billion.

source: དམ་པའི་ཆོས་ནི་ལོ་སུམ་ཁྲི་ལྔ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for thirty-five thousand years.
